export default{
    data : {
        vuemovie : 
        ['가독성이 좋으며 빠른 렌더링을 강점으로 효율성 좋은 개발이 가능합니다.',
         '중앙 집중화된 상태 정보 관리가 가능합니다. 상태 정보가 변경되는 상황과 시간을 보다 쉽게 추적할 수 있었습니다.',
        '단순한 검색 사이트가 아닌 상품성을 띈 프로젝트를 진행해보고자 로고메이커를 사용했습니다.',
        'Vue Axios를 통해 API를 받아와 수천, 수만가지의 데이터를 조회하고 사용할 수 있습니다. '],
        nodechat : ['가볍고 효율적인 JS 라이브러리입니다. DOM탐색이나 이벤트, 애니메이션, ajax에 활용하였습니다.',
        '프론트엔드부터 백엔드까지 사용가능하며, 우수한 성능과 서버확장의 용이성등을 고려해 사용하게되었습니다.',
        '개발자가 모든 종류의 서버 사이드 도구들과 어플리케이션을 JS로 만들수 있도록 해주는 런타임 환경입니다.',
         'node.js 와 연결해주는 mongoose를 사용해 소규모 프로젝트에 알맞는 빠른속도와 특성을 고려해 사용하게 되었습니다.'],
        perfectday : ['가볍고 효율적인 JS 라이브러리입니다. DOM탐색이나 이벤트, 애니메이션, ajax에 활용하였습니다.',
        '프론트엔드부터 백엔드까지 사용가능하며, 우수한 성능과 서버확장의 용이성등을 고려해 사용하게되었습니다.',
        '개발자가 모든 종류의 서버 사이드 도구들과 어플리케이션을 JS로 만들수 있도록 해주는 런타임 환경입니다.',
         '계획과 시간을 중점으로 한 웹임으로, 캘린더 라이브러리를 활용하였습니다.'],
        outdoorschool : ['쇼핑몰 솔루션 중 가장 대중화된 플랫폼입니다. 재직이전에 사용하던 고도몰5 솔루션을 정리하고 직접 자사몰 오픈부터 스킨적용, 상품 및 결제시스템, 사용자 친화적 인터페이스까지 도맡아 완성하였습니다.',
        '가볍고 효율적인 JS 라이브러리입니다. DOM탐색이나 이벤트, 애니메이션, ajax에 활용하였습니다.',
        '쇼핑몰 UI에 핵심적인 Slide-UI를 사용하기위해 swiper를 사용하였습니다.'],
        portfolio : ['가독성이 좋으며 빠른 렌더링을 강점으로 효율성 좋은 개발이 가능합니다.',
        '중앙 집중화된 상태 정보 관리가 가능합니다. 상태 정보가 변경되는 상황과 시간을 보다 쉽게 추적할 수 있었습니다.',
        'SSR의 최대 강점인 SEO (검색엔진 최적화)를 위해 사용하게 되었습니다. 이외에도 Webpack, Vue-loader등 자체적으로 포함된 기능들을 활용하였습니다.',
        'Vue.js의 컴포넌트 라이브러리이며, 깔끔하고 완성도높은 UI를 만들고자 사용하였습니다.'
    ]
    }
}